#### Color Members

---

|  |
| --- |
| Color Class   Constructors   Methods   Properties   See Also |

The  Color  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | Color | Constructor that takes the red, green and blue channels of the color. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | Causes the object to release immediately any resources it may be utilizing. (Inherited from  APIObject  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | Blue | Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
| Public property | Green | Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
| Public property Static member | InvalidColorValue | Get the invalid Color whose IntegerValue is -1. |
| Public property | IsReadOnly | Identifies if the object is read-only or modifiable. (Inherited from  APIObject  .) |
| Public property | IsValid | Identifies if the color represents a valid color, or an uninitialized/invalid value. |
| Public property | Red | Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |

# See Also

Color Class

Autodesk.Revit.DB Namespace